Revit 2016 API
Document.GetDocumentVersion Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public static DocumentVersion GetDocumentVersion(
	Document doc
)
Visual Basic
Public Shared Function GetDocumentVersion ( _
	doc As Document _
) As DocumentVersion
Visual C++
public:
static DocumentVersion^ GetDocumentVersion(
	Document^ doc
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
See Also
Document Class
Autodesk.Revit.DB Namespace